In [ ]:
##Pandas-DataFrame And Series

In [1]:
##Pandas is a powerful data manipulation library in python , widely used for data analysis and data cleaning.It provides two primary data structures :series and dataframe .A series is one-dimensional array -like object ,while a dataframe is a two-dimensional ,size-mutable and potentially heterogeneous tabular data structure with labeled axes(rows and columns).

In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\hp\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\hp\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

In [4]:
data=[1,2,3,4,5,6]
print(pd.Series(data))

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [9]:
data={
  'Name':['vivek','akash','shivani','sonu'],
  'Age':[21,22,23,43],
  'City':['Hajipur','Patna','New Delhi','Lucknow']

}

df=pd.DataFrame(data)
print(df)

      Name  Age       City
0    vivek   21    Hajipur
1    akash   22      Patna
2  shivani   23  New Delhi
3     sonu   43    Lucknow

In [10]:
import numpy as np
np.array(df)

array([['vivek', 21, 'Hajipur'],
       ['akash', 22, 'Patna'],
       ['shivani', 23, 'New Delhi'],
       ['sonu', 43, 'Lucknow']], dtype=object)

In [11]:
df.loc[0][0]

C:\Users\HP\AppData\Local\Temp\ipykernel_11252\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'vivek'

In [12]:
df.iloc[0]

Name      vivek
Age          21
City    Hajipur
Name: 0, dtype: object

In [13]:
df.iloc[2]

Name      shivani
Age            23
City    New Delhi
Name: 2, dtype: object

In [14]:
df.iloc[3]

Name       sonu
Age          43
City    Lucknow
Name: 3, dtype: object

In [15]:
df

      Name  Age       City
0    vivek   21    Hajipur
1    akash   22      Patna
2  shivani   23  New Delhi
3     sonu   43    Lucknow

In [20]:
df.Name

0      vivek
1      akash
2    shivani
3       sonu
Name: Name, dtype: object

In [24]:
df.at[0,'Age']

21

In [28]:
df.iat[3,2]

'Lucknow'

In [29]:
df

      Name  Age       City
0    vivek   21    Hajipur
1    akash   22      Patna
2  shivani   23  New Delhi
3     sonu   43    Lucknow

In [30]:
df['salary']=[20000,25000,50000,38000]
df

      Name  Age       City  salary
0    vivek   21    Hajipur   20000
1    akash   22      Patna   25000
2  shivani   23  New Delhi   50000
3     sonu   43    Lucknow   38000

In [33]:
df['Age']=df['Age']+2
df

      Name  Age       City  salary
0    vivek   23    Hajipur   20000
1    akash   24      Patna   25000
2  shivani   25  New Delhi   50000
3     sonu   45    Lucknow   38000

In [35]:
df.drop(0)

      Name  Age       City  salary
1    akash   24      Patna   25000
2  shivani   25  New Delhi   50000
3     sonu   45    Lucknow   38000

In [36]:
df

      Name  Age       City  salary
0    vivek   23    Hajipur   20000
1    akash   24      Patna   25000
2  shivani   25  New Delhi   50000
3     sonu   45    Lucknow   38000

In [39]:
df.describe

<bound method NDFrame.describe of       Name  Age       City  salary
0    vivek   23    Hajipur   20000
1    akash   24      Patna   25000
2  shivani   25  New Delhi   50000
3     sonu   45    Lucknow   38000>